Revit 2024 API
RebarShapeDefinition.SetParameterFormula Method
 Associate a formula with the parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2009
Syntax
C#
public void SetParameterFormula(
	ElementId paramId,
	string formula
)
Visual Basic
Public Sub SetParameterFormula ( _
	paramId As ElementId, _
	formula As String _
)
Visual C++
public:
void SetParameterFormula(
	ElementId^ paramId,
	String^ formula
)
Parameters
paramId
Type: Autodesk.Revit.DB.ElementId
 Id of a parameter in the definition.
formula
Type: System.String
 The formula expressed as a string. The string is exactly what a user would type into the Family Types dialog, e.g. "Total Length*3.14159*(Bar Diameter/2)*(Bar Diameter/2)"
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  This RebarShapeDefinition does not have a value for the parameter paramId.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace